---
kind: method
id: M:Autodesk.Revit.DB.SATExportOptions.Dispose
source: html/0256cc21-76ea-f877-112d-ff47ce49a034.htm
---
# Autodesk.Revit.DB.SATExportOptions.Dispose Method

Releases all resources used by the SATExportOptions

## Syntax (C#)
```csharp
public void Dispose()
```